# 다음 퀴즈를 수행하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [2]:
df = pd.read_csv("class_scores.csv")
type(df)

pandas.core.frame.DataFrame

### Q3. df의 첫 3개 row를 출력하시오

In [3]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [ ]:
df.tail(2)

### Q5. df의 차원을 확인하시오

In [ ]:
df.ndim

### Q6. df의 row 개수를 확인하시오

In [ ]:
print(df.shape[0])
print(len(df))

### Q7. df의 column 개수를 확인하시오

In [ ]:
print(df.shape[1])
print(len(df.columns))

### Q8. df의 column 이름을 확인하시오

In [ ]:
df.columns

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [29]:
df_sub = df.loc[df["grade"] == 2, ]
print(df_sub.head(2))
print(set(df_sub["grade"]))

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
200   20101      2     A      M    57       68       98         88       40
201   20102      2     A      F    94       33       32         44       90
{2}

In [ ]:
# 1)
df_sub = df_sub.loc[:, ["Stu_ID",  "grade", "Math",  "English", "Science", "Marketing", "Writing"]]

In [ ]:
# 2)
df_sub = df_sub.iloc[:, [0, 1, 4, 5, 6, 7, 8]]

In [30]:
# 3)
# np.r_[0, 3:8]
df_sub = df_sub.iloc[:, np.r_[0, 1, 4:9]]

array([0, 3, 4, 5, 6, 7])

In [ ]:
# 4)
df_sub = df_sub.iloc[:, np.r_[:2, 4:9]]

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [7]:
df_sub.head(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
200   20101      2     A      M    57       68       98         88       40
201   20102      2     A      F    94       33       32         44       90

In [10]:
len(df_sub) == len(set(df_sub["Stu_ID"]))

True

In [15]:
df_sub.iloc[:2, 4:]

     Math  English  Science  Marketing  Writing
200    57       68       98         88       40
201    94       33       32         44       90

In [14]:
df_sub.iloc[:2, 4:].mean(axis = 1)

200    70.2
201    58.6
dtype: float64

In [16]:
mean_test = df_sub.iloc[:2, 4:].mean(axis = 1)
type(mean_test)

pandas.core.series.Series

In [20]:
df_sub_mean = df_sub.iloc[:, 4:].mean(axis = 1)
df_sub_mean.head(2)

200    70.2
201    58.6
dtype: float64

In [24]:
# 1)
df_sub["score_mean"] = df_sub_mean
df_sub.head(2)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Stu_ID,grade,class,gender,Math,English,Science,Marketing,Writing,score_mean
200,20101,2,A,M,57,68,98,88,40,70.2
201,20102,2,A,F,94,33,32,44,90,58.6

In [25]:
df_g2_mean = pd.DataFrame({"Stu_ID": df_sub["Stu_ID"],
                           "Score_mean": df_sub_mean})
df_g2_mean.head(2)

     Stu_ID  Score_mean
200   20101        70.2
201   20102        58.6

In [ ]:
df_g2_mean.to_csv("day2_quiz_01_score_avg.csv", index = False)

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [36]:
score_max = df_sub.iloc[:, 4:].max()
score_min = df_sub.iloc[:, 4:].min()
score_std = df_sub.iloc[:, 4:].std()

In [43]:
score_stat = pd.DataFrame({"max": score_max,
                           "min": score_min,
                           "std": score_std})
score_stat

           max  min        std
Math       100   25  21.966154
English    100   25  20.638307
Science    100   25  23.344244
Marketing  100   25  22.021939
Writing    100   25  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [46]:
score_stat.index = np.arange(5)
score_stat

   max  min        std
0  100   25  21.966154
1  100   25  20.638307
2  100   25  23.344244
3  100   25  22.021939
4  100   25  21.772637

In [47]:
score_stat.set_index(np.arange(5))

   max  min        std
0  100   25  21.966154
1  100   25  20.638307
2  100   25  23.344244
3  100   25  22.021939
4  100   25  21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [ ]:
score_stat.to_csv("score_stat.csv")